jimmywong2003/nrf5-modify-device-parameter-through-host/ble_app_change_advertising_example/sdk_mod/ble_services/ble_tcs.c
/*
   Copyright (c) 2010 - 2017, Nordic Semiconductor ASA
   All rights reserved.

   Redistribution and use in source and binary forms, with or without modification,
   are permitted provided that the following conditions are met:

   1. Redistributions of source code must retain the above copyright notice, this
     list of conditions and the following disclaimer.

   2. Redistributions in binary form, except as embedded into a Nordic
     Semiconductor ASA integrated circuit in a product or a software update for
     such product, must reproduce the above copyright notice, this list of
     conditions and the following disclaimer in the documentation and/or other
     materials provided with the distribution.

   3. Neither the name of Nordic Semiconductor ASA nor the names of its
     contributors may be used to endorse or promote products derived from this
     software without specific prior written permission.

   4. This software, with or without modification, must only be used with a
     Nordic Semiconductor ASA integrated circuit.

   5. Any software provided in binary form under this license must not be reverse
     engineered, decompiled, modified and/or disassembled.

   THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
   OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
   OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
   DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
   LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
   CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
   GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
   HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
   LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
   OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

 #include "sdk_common.h"
 #if NRF_MODULE_ENABLED(BLE_TCS)
 #include "ble_tcs.h"
 #include <string.h>
 #include "ble_srv_common.h"
 #include "ble_conn_state.h"

 #define NRF_LOG_MODULE_NAME ble_tcs
 #if BLE_TCS_CONFIG_LOG_ENABLED
 #define NRF_LOG_LEVEL       BLE_TCS_CONFIG_LOG_LEVEL
 #define NRF_LOG_INFO_COLOR  BLE_TCS_CONFIG_INFO_COLOR
 #define NRF_LOG_DEBUG_COLOR BLE_TCS_CONFIG_DEBUG_COLOR
 #else // BLE_TCS_CONFIG_LOG_ENABLED
 #define NRF_LOG_LEVEL       4
 #endif // BLE_TCS_CONFIG_LOG_ENABLED
 #include "nrf_log.h"

NRF_LOG_MODULE_REGISTER();


#define BLE_UUID_TCS_DEVICE_NAME_CHAR   0x0101                      /**< The UUID of the device name Characteristic. */
#define BLE_UUID_TCS_ADV_PARAMS_CHAR    0x0102                      /**< The UUID of the advertising parameters Characteristic. */
#define BLE_UUID_TCS_APPEARANCE_CHAR    0x0103                      /**< The UUID of the appearance Characteristic. */
#define BLE_UUID_TCS_CONN_PARAM_CHAR    0x0104                      /**< The UUID of the connection parameters Characteristic. */
#define BLE_UUID_TCS_BEACON_PARAM_CHAR  0x0105                      /**< The UUID of the beacon Characteristic. */
#define BLE_UUID_TCS_CLOUD_PARAM_CHAR   0x0106                      /**< The UUID of the cloud token Characteristic. */
#define BLE_UUID_TCS_FW_VERSION_CHAR    0x0107                      /**< The UUID of the FW version Characteristic. */
#define BLE_UUID_TCS_MTU_CHAR           0x0108                      /**< The UUID of the MTU Characteristic. */

// EF68xxxx-9B35-4933-9B10-52FFA9740042
#define TCS_BASE_UUID                  {{0x42, 0x00, 0x74, 0xA9, 0xFF, 0x52, 0x10, 0x9B, 0x33, 0x49, 0x35, 0x9B, 0x00, 0x00, 0x68, 0xEF}} /**< Used vendor specific UUID. */


/**@brief Function for handling the @ref BLE_GAP_EVT_CONNECTED event from the S132 SoftDevice.
 *
 * @param[in] p_tcs     Thingy Configuration Service structure.
 * @param[in] p_ble_evt Pointer to the event received from BLE stack.
 */
static void on_connect(ble_tcs_t * p_tcs, ble_evt_t * p_ble_evt)
{
        p_tcs->conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
}


/**@brief Function for handling the @ref BLE_GAP_EVT_DISCONNECTED event from the S132 SoftDevice.
 *
 * @param[in] p_tcs     Thingy Configuration Service structure.
 * @param[in] p_ble_evt Pointer to the event received from BLE stack.
 */
static void on_disconnect(ble_tcs_t * p_tcs, ble_evt_t * p_ble_evt)
{
        UNUSED_PARAMETER(p_ble_evt);
        p_tcs->conn_handle = BLE_CONN_HANDLE_INVALID;
}


static void on_authorize_req(ble_tcs_t * p_tcs, ble_evt_t * p_ble_evt)
{
        ble_gatts_evt_rw_authorize_request_t * p_evt_rw_authorize_request = &p_ble_evt->evt.gatts_evt.params.authorize_request;
        uint32_t err_code;

        if (p_evt_rw_authorize_request->type  == BLE_GATTS_AUTHORIZE_TYPE_WRITE)
        {
                ble_gatts_rw_authorize_reply_params_t rw_authorize_reply;
                bool valid_data = true;
                bool reply = true;
                ble_tcs_evt_type_t evt_type = BLE_TCS_EVT_DEV_NAME;


                if (p_evt_rw_authorize_request->request.write.handle == p_tcs->dev_name_handles.value_handle)
                {
                        evt_type = BLE_TCS_EVT_DEV_NAME;

                        // Check for valid data
                        if(p_evt_rw_authorize_request->request.write.len > BLE_TCS_DEVICE_NAME_LEN_MAX)
                        {
                                valid_data = false;
                        }
                }
                else if (p_evt_rw_authorize_request->request.write.handle == p_tcs->adv_param_handles.value_handle)
                {
                        // Check for valid data
                        if(p_evt_rw_authorize_request->request.write.len != sizeof(ble_tcs_adv_params_t))
                        {
                                valid_data = false;
                        }
                        else
                        {
                                ble_tcs_adv_params_t * p_data = (ble_tcs_adv_params_t *)p_evt_rw_authorize_request->request.write.data;

                                evt_type = BLE_TCS_EVT_ADV_PARAM;

                                if ( (p_data->interval  < TCS_ADV_PARAMS_INTERVAL_MIN)    ||
                                     (p_data->interval  > TCS_ADV_PARAMS_INTERVAL_MAX)    ||
                                     /* (p_data->timeout  < TCS_ADV_PARAMS_TIMEOUT_MIN)      || */
                                     (p_data->timeout  > TCS_ADV_PARAMS_TIMEOUT_MAX))
                                {
                                        valid_data = false;
                                }
                        }
                }
                else if (p_evt_rw_authorize_request->request.write.handle == p_tcs->conn_param_handles.value_handle)
                {
                        // Check for valid data
                        if(p_evt_rw_authorize_request->request.write.len != sizeof(ble_tcs_conn_params_t))
                        {
                                valid_data = false;
                        }
                        else
                        {
                                ble_tcs_conn_params_t * p_data = (ble_tcs_conn_params_t *)p_evt_rw_authorize_request->request.write.data;

