jimmywong2003/nrf5-modify-device-parameter-through-host/ble_app_change_advertising_example/sdk_mod/ble_services/ble_tcs.c
                                evt_type = BLE_TCS_EVT_CONN_PARAM;

                                if ( (p_data->min_conn_int  < BLE_GAP_CP_MIN_CONN_INTVL_MIN)    ||
                                     (p_data->min_conn_int  > BLE_GAP_CP_MIN_CONN_INTVL_MAX)    ||
                                     (p_data->max_conn_int  < BLE_GAP_CP_MAX_CONN_INTVL_MIN)    ||
                                     (p_data->max_conn_int  > BLE_GAP_CP_MAX_CONN_INTVL_MAX)    ||
                                     (p_data->slave_latency > BLE_GAP_CP_SLAVE_LATENCY_MAX)     ||
                                     (p_data->sup_timeout   < BLE_GAP_CP_CONN_SUP_TIMEOUT_MIN)  ||
                                     (p_data->sup_timeout   > BLE_GAP_CP_CONN_SUP_TIMEOUT_MAX))
                                {
                                        valid_data = false;
                                }

                                /* If both conn_sup_timeout and max_conn_interval are specified, then the following constraint applies:
                                   conn_sup_timeout * 4 > (1 + slave_latency) * max_conn_interval
                                   that corresponds to the following Bluetooth Spec requirement:
                                   The Supervision_Timeout in milliseconds shall be larger than
                                   (1 + Conn_Latency) * Conn_Interval_Max * 2, where Conn_Interval_Max is given in milliseconds.   */

                                if ( (p_data->sup_timeout * 4) <= ((1 + p_data->slave_latency) * p_data->max_conn_int) )
                                {
                                        valid_data = false;
                                }
                        }
                }
                else if (p_evt_rw_authorize_request->request.write.handle == p_tcs->beacon_handles.value_handle)
                {
                        evt_type = BLE_TCS_EVT_BEACON;

                        if (p_evt_rw_authorize_request->request.write.len > 0)
                        {
                                // Check for valid data
                                if( (p_evt_rw_authorize_request->request.write.len > BLE_TCS_BEACON_LEN_MAX) ||
                                    (p_evt_rw_authorize_request->request.write.len < BLE_TCS_BEACON_LEN_MIN))
                                {
                                        valid_data = false;
                                }
                        }
                }
                else if (p_evt_rw_authorize_request->request.write.handle == p_tcs->mtu_handles.value_handle)
                {
                        // Check for valid data
                        if(p_evt_rw_authorize_request->request.write.len != sizeof(ble_tcs_mtu_t))
                        {
                                valid_data = false;
                        }
                        else
                        {
                                ble_tcs_mtu_t * p_data = (ble_tcs_mtu_t *)p_evt_rw_authorize_request->request.write.data;

                                evt_type = BLE_TCS_EVT_MTU;

                                if ( /*(p_data->req   < TCS_MTU_REQ_MIN)      || */
                                        (p_data->req   > TCS_MTU_REQ_MAX)      ||
                                        (p_data->size  < TCS_MTU_SIZE_MIN)     ||
                                        (p_data->size  > TCS_MTU_SIZE_MAX))
                                {
                                        valid_data = false;
                                }
                        }
                }

                else
                {
                        valid_data = false;
                        reply = false;
                }

                if (reply)
                {
                        // Reply depending on valid data or not
                        rw_authorize_reply.type = BLE_GATTS_AUTHORIZE_TYPE_WRITE;

                        if (valid_data)
                        {
                                rw_authorize_reply.params.write.update      = 1;
                                rw_authorize_reply.params.write.gatt_status = BLE_GATT_STATUS_SUCCESS;
                                rw_authorize_reply.params.write.p_data      = p_evt_rw_authorize_request->request.write.data;
                                rw_authorize_reply.params.write.len         = p_evt_rw_authorize_request->request.write.len;
                                rw_authorize_reply.params.write.offset      = p_evt_rw_authorize_request->request.write.offset;
                        }
                        else
                        {
                                rw_authorize_reply.params.write.update      = 0;
                                rw_authorize_reply.params.write.gatt_status = BLE_GATT_STATUS_ATTERR_WRITE_NOT_PERMITTED;
                        }

                        err_code = sd_ble_gatts_rw_authorize_reply(p_ble_evt->evt.gatts_evt.conn_handle,
                                                                   &rw_authorize_reply);
                        APP_ERROR_CHECK(err_code);
                }

                // Call event handler
                if ( valid_data && (p_tcs->evt_handler != NULL))
                {
                        p_tcs->evt_handler(p_tcs,
                                           evt_type,
                                           p_evt_rw_authorize_request->request.write.data,
                                           p_evt_rw_authorize_request->request.write.len);
                }
        }
}


/**@brief Function for adding device name characteristic.
 *
 * @param[in] p_tcs       Thingy Configuration Service structure.
 * @param[in] p_tcs_init  Information needed to initialize the service.
 *
 * @return NRF_SUCCESS on success, otherwise an error code.
 */
static uint32_t device_name_char_add(ble_tcs_t * p_tcs, const ble_tcs_init_t * p_tcs_init)
{
        ble_gatts_char_md_t char_md;
        ble_gatts_attr_t attr_char_value;
        ble_uuid_t ble_uuid;
        ble_gatts_attr_md_t attr_md;

        memset(&char_md, 0, sizeof(char_md));

