jimmywong2003/nrf5-modify-device-parameter-through-host/ble_app_change_advertising_example/sdk_mod/ble_services/ble_tcs.c
        char_md.char_props.write         = 1;
        char_md.char_props.write_wo_resp = 0;
        char_md.char_props.read          = 1;
        char_md.p_char_user_desc         = NULL;
        char_md.p_char_pf                = NULL;
        char_md.p_user_desc_md           = NULL;
        char_md.p_cccd_md                = NULL;
        char_md.p_sccd_md                = NULL;

        ble_uuid.type = p_tcs->uuid_type;
        ble_uuid.uuid = BLE_UUID_TCS_DEVICE_NAME_CHAR;

        memset(&attr_md, 0, sizeof(attr_md));

        BLE_GAP_CONN_SEC_MODE_SET_OPEN(&attr_md.read_perm);
        BLE_GAP_CONN_SEC_MODE_SET_OPEN(&attr_md.write_perm);

        attr_md.vloc    = BLE_GATTS_VLOC_STACK;
        attr_md.rd_auth = 0;
        attr_md.wr_auth = 1;
        attr_md.vlen    = 1;

        memset(&attr_char_value, 0, sizeof(attr_char_value));

        attr_char_value.p_uuid    = &ble_uuid;
        attr_char_value.p_attr_md = &attr_md;
        attr_char_value.init_len  = p_tcs_init->p_init_vals->dev_name.len;
        attr_char_value.init_offs = 0;
        attr_char_value.p_value   = p_tcs_init->p_init_vals->dev_name.name;
        attr_char_value.max_len   = BLE_TCS_DEVICE_NAME_LEN_MAX;

        return sd_ble_gatts_characteristic_add(p_tcs->service_handle,
                                               &char_md,
                                               &attr_char_value,
                                               &p_tcs->dev_name_handles);
}


/**@brief Function for adding advertising parameters characteristic.
 *
 * @param[in] p_tcs       Thingy Configuration Service structure.
 * @param[in] p_tcs_init  Information needed to initialize the service.
 *
 * @return NRF_SUCCESS on success, otherwise an error code.
 */
static uint32_t adv_params_char_add(ble_tcs_t * p_tcs, const ble_tcs_init_t * p_tcs_init)
{
        ble_gatts_char_md_t char_md;
        ble_gatts_attr_t attr_char_value;
        ble_uuid_t ble_uuid;
        ble_gatts_attr_md_t attr_md;

        memset(&char_md, 0, sizeof(char_md));

        char_md.char_props.write         = 1;
        char_md.char_props.write_wo_resp = 0;
        char_md.char_props.read          = 1;
        char_md.p_char_user_desc         = NULL;
        char_md.p_char_pf                = NULL;
        char_md.p_user_desc_md           = NULL;
        char_md.p_cccd_md                = NULL;
        char_md.p_sccd_md                = NULL;

        ble_uuid.type = p_tcs->uuid_type;
        ble_uuid.uuid = BLE_UUID_TCS_ADV_PARAMS_CHAR;

        memset(&attr_md, 0, sizeof(attr_md));

        BLE_GAP_CONN_SEC_MODE_SET_OPEN(&attr_md.read_perm);
        BLE_GAP_CONN_SEC_MODE_SET_OPEN(&attr_md.write_perm);

        attr_md.vloc    = BLE_GATTS_VLOC_STACK;
        attr_md.rd_auth = 0;
        attr_md.wr_auth = 1;
        attr_md.vlen    = 1;

        memset(&attr_char_value, 0, sizeof(attr_char_value));

        attr_char_value.p_uuid    = &ble_uuid;
        attr_char_value.p_attr_md = &attr_md;
        attr_char_value.init_len  = sizeof(ble_tcs_adv_params_t);
        attr_char_value.init_offs = 0;
        attr_char_value.p_value   = (uint8_t *)&p_tcs_init->p_init_vals->adv_params;
        attr_char_value.max_len   = sizeof(ble_tcs_adv_params_t);

        return sd_ble_gatts_characteristic_add(p_tcs->service_handle,
                                               &char_md,
                                               &attr_char_value,
                                               &p_tcs->adv_param_handles);
}


/**@brief Function for adding connection parameters characteristic.
 *
 * @param[in] p_tcs       Thingy Configuration Service structure.
 * @param[in] p_tcs_init  Information needed to initialize the service.
 *
 * @return NRF_SUCCESS on success, otherwise an error code.
 */
static uint32_t conn_params_char_add(ble_tcs_t * p_tcs, const ble_tcs_init_t * p_tcs_init)
{
        ble_gatts_char_md_t char_md;
        ble_gatts_attr_t attr_char_value;
        ble_uuid_t ble_uuid;
        ble_gatts_attr_md_t attr_md;

        memset(&char_md, 0, sizeof(char_md));

        char_md.char_props.write         = 1;
        char_md.char_props.write_wo_resp = 0;
        char_md.char_props.read          = 1;
        char_md.p_char_user_desc         = NULL;
        char_md.p_char_pf                = NULL;
        char_md.p_user_desc_md           = NULL;
        char_md.p_cccd_md                = NULL;
        char_md.p_sccd_md                = NULL;

        ble_uuid.type = p_tcs->uuid_type;
        ble_uuid.uuid = BLE_UUID_TCS_CONN_PARAM_CHAR;

        memset(&attr_md, 0, sizeof(attr_md));

        BLE_GAP_CONN_SEC_MODE_SET_OPEN(&attr_md.read_perm);
        BLE_GAP_CONN_SEC_MODE_SET_OPEN(&attr_md.write_perm);

        attr_md.vloc    = BLE_GATTS_VLOC_STACK;
        attr_md.rd_auth = 0;
        attr_md.wr_auth = 1;
        attr_md.vlen    = 1;

        memset(&attr_char_value, 0, sizeof(attr_char_value));

        attr_char_value.p_uuid    = &ble_uuid;
        attr_char_value.p_attr_md = &attr_md;
        attr_char_value.init_len  = sizeof(ble_tcs_conn_params_t);
        attr_char_value.init_offs = 0;
        attr_char_value.p_value   = (uint8_t *)&p_tcs_init->p_init_vals->conn_params;
        attr_char_value.max_len   = sizeof(ble_tcs_conn_params_t);

        return sd_ble_gatts_characteristic_add(p_tcs->service_handle,
                                               &char_md,
                                               &attr_char_value,
                                               &p_tcs->conn_param_handles);
}


/**@brief Function for adding beacon characteristic.
 *
 * @param[in] p_tcs       Thingy Configuration Service structure.
 * @param[in] p_tcs_init  Information needed to initialize the service.
 *
 * @return NRF_SUCCESS on success, otherwise an error code.
 */
static uint32_t beacon_data_char_add(ble_tcs_t * p_tcs, const ble_tcs_init_t * p_tcs_init)
{
        ble_gatts_char_md_t char_md;
        ble_gatts_attr_t attr_char_value;
        ble_uuid_t ble_uuid;
        ble_gatts_attr_md_t attr_md;

        memset(&char_md, 0, sizeof(char_md));

