jimmywong2003/nrf5-modify-device-parameter-through-host/ble_app_change_advertising_example/sdk_mod/ble_services/ble_tcs.c
        char_md.char_props.write         = 1;
        char_md.char_props.write_wo_resp = 0;
        char_md.char_props.read          = 1;
        char_md.p_char_user_desc         = NULL;
        char_md.p_char_pf                = NULL;
        char_md.p_user_desc_md           = NULL;
        char_md.p_cccd_md                = NULL;
        char_md.p_sccd_md                = NULL;

        ble_uuid.type = p_tcs->uuid_type;
        ble_uuid.uuid = BLE_UUID_TCS_BEACON_PARAM_CHAR;

        memset(&attr_md, 0, sizeof(attr_md));

        BLE_GAP_CONN_SEC_MODE_SET_OPEN(&attr_md.read_perm);
        BLE_GAP_CONN_SEC_MODE_SET_OPEN(&attr_md.write_perm);

        attr_md.vloc    = BLE_GATTS_VLOC_STACK;
        attr_md.rd_auth = 0;
        attr_md.wr_auth = 1;
        attr_md.vlen    = 1;

        memset(&attr_char_value, 0, sizeof(attr_char_value));

        attr_char_value.p_uuid    = &ble_uuid;
        attr_char_value.p_attr_md = &attr_md;
        attr_char_value.init_len  = p_tcs_init->p_init_vals->eddystone_url.len;
        attr_char_value.init_offs = 0;
        attr_char_value.p_value   = p_tcs_init->p_init_vals->eddystone_url.data;
        attr_char_value.max_len   = BLE_TCS_MAX_DATA_LEN;

        return sd_ble_gatts_characteristic_add(p_tcs->service_handle,
                                               &char_md,
                                               &attr_char_value,
                                               &p_tcs->beacon_handles);
}

/**@brief Function for adding FW version characteristic.
 *
 * @param[in] p_tcs       Thingy Configuration Service structure.
 * @param[in] p_tcs_init  Information needed to initialize the service.
 *
 * @return NRF_SUCCESS on success, otherwise an error code.
 */
static uint32_t fw_version_char_add(ble_tcs_t * p_tcs, const ble_tcs_init_t * p_tcs_init)
{
        ble_gatts_char_md_t char_md;
        ble_gatts_attr_t attr_char_value;
        ble_uuid_t ble_uuid;
        ble_gatts_attr_md_t attr_md;

        memset(&char_md, 0, sizeof(char_md));

        char_md.char_props.read          = 1;
        char_md.p_char_user_desc         = NULL;
        char_md.p_char_pf                = NULL;
        char_md.p_user_desc_md           = NULL;
        char_md.p_cccd_md                = NULL;
        char_md.p_sccd_md                = NULL;

        ble_uuid.type = p_tcs->uuid_type;
        ble_uuid.uuid = BLE_UUID_TCS_FW_VERSION_CHAR;

        memset(&attr_md, 0, sizeof(attr_md));

        BLE_GAP_CONN_SEC_MODE_SET_OPEN(&attr_md.read_perm);

        attr_md.vloc    = BLE_GATTS_VLOC_STACK;
        attr_md.rd_auth = 0;
        attr_md.wr_auth = 0;
        attr_md.vlen    = 1;

        memset(&attr_char_value, 0, sizeof(attr_char_value));

        attr_char_value.p_uuid    = &ble_uuid;
        attr_char_value.p_attr_md = &attr_md;
        attr_char_value.init_len  = sizeof(ble_tcs_fw_version_t);
        attr_char_value.init_offs = 0;
        attr_char_value.p_value   = (uint8_t *)&p_tcs_init->p_init_vals->fw_version;
        attr_char_value.max_len   = sizeof(ble_tcs_fw_version_t);

        return sd_ble_gatts_characteristic_add(p_tcs->service_handle,
                                               &char_md,
                                               &attr_char_value,
                                               &p_tcs->fwv_handles);
}


/**@brief Function for adding MTU characteristic.
 *
 * @param[in] p_tcs       Thingy Configuration Service structure.
 * @param[in] p_tcs_init  Information needed to initialize the service.
 *
 * @return NRF_SUCCESS on success, otherwise an error code.
 */
static uint32_t mtu_char_add(ble_tcs_t * p_tcs, const ble_tcs_init_t * p_tcs_init)
{
        ble_gatts_char_md_t char_md;
        ble_gatts_attr_t attr_char_value;
        ble_uuid_t ble_uuid;
        ble_gatts_attr_md_t attr_md;

        memset(&char_md, 0, sizeof(char_md));

        char_md.char_props.read          = 1;
        char_md.char_props.write_wo_resp = 0;
        char_md.char_props.write         = 1;
        char_md.p_char_user_desc         = NULL;
        char_md.p_char_pf                = NULL;
        char_md.p_user_desc_md           = NULL;
        char_md.p_cccd_md                = NULL;
        char_md.p_sccd_md                = NULL;

        ble_uuid.type = p_tcs->uuid_type;
        ble_uuid.uuid = BLE_UUID_TCS_MTU_CHAR;

        memset(&attr_md, 0, sizeof(attr_md));

        BLE_GAP_CONN_SEC_MODE_SET_OPEN(&attr_md.read_perm);
        BLE_GAP_CONN_SEC_MODE_SET_OPEN(&attr_md.write_perm);

        attr_md.vloc    = BLE_GATTS_VLOC_STACK;
        attr_md.rd_auth = 0;
        attr_md.wr_auth = 1;
        attr_md.vlen    = 1;

        memset(&attr_char_value, 0, sizeof(attr_char_value));

        attr_char_value.p_uuid    = &ble_uuid;
        attr_char_value.p_attr_md = &attr_md;
        attr_char_value.init_len  = sizeof(ble_tcs_mtu_t);
        attr_char_value.init_offs = 0;
        attr_char_value.p_value   = (uint8_t *)&p_tcs_init->p_init_vals->mtu;
        attr_char_value.max_len   = sizeof(ble_tcs_mtu_t);

        return sd_ble_gatts_characteristic_add(p_tcs->service_handle,
                                               &char_md,
                                               &attr_char_value,
                                               &p_tcs->mtu_handles);
}


void ble_tcs_on_ble_evt(ble_evt_t const * p_ble_evt, void * p_context)//(ble_tcs_t * p_tcs, ble_evt_t * p_ble_evt)
{

        NRF_LOG_INFO("tcs on ble %x", p_ble_evt->header.evt_id);

        // if ((p_tcs == NULL) || (p_ble_evt == NULL))
        // {
        //         return;
        // }

        if ((p_context == NULL) || (p_ble_evt == NULL))
        {
                return;
        }

        ble_tcs_t * p_tcs = (ble_tcs_t *)p_context;

        switch (p_ble_evt->header.evt_id)
        {
        case BLE_GAP_EVT_CONNECTED:
                on_connect(p_tcs, p_ble_evt);
                break;

        case BLE_GAP_EVT_DISCONNECTED:
                on_disconnect(p_tcs, p_ble_evt);
                break;

        case BLE_GATTS_EVT_RW_AUTHORIZE_REQUEST:
                on_authorize_req(p_tcs, p_ble_evt);
                break;

        default:
                // No implementation needed.
                break;
        }
}


uint32_t ble_tcs_init(ble_tcs_t * p_tcs, const ble_tcs_init_t * p_tcs_init)
{
        uint32_t err_code;
        ble_uuid_t ble_uuid;
        ble_uuid128_t tcs_base_uuid = TCS_BASE_UUID;

        VERIFY_PARAM_NOT_NULL(p_tcs);
        VERIFY_PARAM_NOT_NULL(p_tcs_init);

        // Initialize the service structure.
        p_tcs->conn_handle                  = BLE_CONN_HANDLE_INVALID;
        p_tcs->evt_handler                  = p_tcs_init->evt_handler;

        // Add a custom base UUID.
        err_code = sd_ble_uuid_vs_add(&tcs_base_uuid, &p_tcs->uuid_type);
        VERIFY_SUCCESS(err_code);

        ble_uuid.type = p_tcs->uuid_type;
        ble_uuid.uuid = BLE_UUID_TCS_SERVICE;

        // Add the service.
        err_code = sd_ble_gatts_service_add(BLE_GATTS_SRVC_TYPE_PRIMARY,
                                            &ble_uuid,
                                            &p_tcs->service_handle);
        VERIFY_SUCCESS(err_code);

        // Add the device name Characteristic.
        err_code = device_name_char_add(p_tcs, p_tcs_init);
        VERIFY_SUCCESS(err_code);

        // Add the advertising parameters Characteristic.
        err_code = adv_params_char_add(p_tcs, p_tcs_init);
        VERIFY_SUCCESS(err_code);

        // Add the connection parameters Characteristic.
        err_code = conn_params_char_add(p_tcs, p_tcs_init);
        VERIFY_SUCCESS(err_code);

        // Add the beacon Characteristic.
        err_code = beacon_data_char_add(p_tcs, p_tcs_init);
        VERIFY_SUCCESS(err_code);

        // Add the FW version Characteristic.
        err_code = fw_version_char_add(p_tcs, p_tcs_init);
        VERIFY_SUCCESS(err_code);

        // Add the MTU Characteristic.
        err_code = mtu_char_add(p_tcs, p_tcs_init);
        VERIFY_SUCCESS(err_code);

        return NRF_SUCCESS;
}

uint32_t ble_tcs_mtu_set(ble_tcs_t * p_tcs, ble_tcs_mtu_t * p_data)
{
        ble_gatts_value_t gatts_value;
        uint16_t length = sizeof(ble_tcs_mtu_t);

        VERIFY_PARAM_NOT_NULL(p_tcs);

        if (p_tcs->conn_handle == BLE_CONN_HANDLE_INVALID)
        {
                return NRF_ERROR_INVALID_STATE;
        }

        gatts_value.len     = length;
        gatts_value.offset  = 0;
        gatts_value.p_value = (uint8_t *)p_data;

        return sd_ble_gatts_value_set(p_tcs->conn_handle, p_tcs->mtu_handles.value_handle, &gatts_value);
}

#endif // NRF_MODULE_ENABLED(BLE_TCS)
